# Tugas #6 Pandas Joining and Merging Data Frame

## Excercise

In [4]:
import numpy as np
import pandas as pd

In [10]:
# Data
registration = pd.DataFrame({'reg_id': [1,2,3,4],
                           'name'  : ['Joko', 'Agus', 'Adit', 'Vincent'],
                           'phone' : ['0867654656465', '08767645335322', 
                                      '0832323232535', '08123424342424']})
login = pd.DataFrame({'log_id': [1,2,3,4],
                      'name'  : ['Bobi', 'Agus', 'Dodo', 'Vincent'],
                      'phone' : ['087463524267', '08767645335322',
                                 '087363767363', '08123424342424']})

registration

   reg_id     name           phone
0       1     Joko   0867654656465
1       2     Agus  08767645335322
2       3     Adit   0832323232535
3       4  Vincent  08123424342424

In [11]:
login

   log_id     name           phone
0       1     Bobi    087463524267
1       2     Agus  08767645335322
2       3     Dodo    087363767363
3       4  Vincent  08123424342424

In [13]:
#1 Registration dan present
regandpresent = pd.merge(registration, login)
regandpresent

   reg_id     name           phone  log_id
0       2     Agus  08767645335322       2
1       4  Vincent  08123424342424       4

In [16]:
#2 Present but didnt registration
all_data = pd.merge(registration, login, how='outer')
all_data[all_data['reg_id'].isnull() == True][['name', 'phone', 'log_id']]

   name         phone  log_id
4  Bobi  087463524267     1.0
5  Dodo  087363767363     3.0

In [17]:
#3 Registration but didnt present
all_data[all_data['log_id'].isnull() == True][['name', 'phone', 'reg_id']]

   name          phone  reg_id
0  Joko  0867654656465     1.0
2  Adit  0832323232535     3.0

In [18]:
#4 Presentase masing-masing
pct_one = (len(pd.merge(registration, login, how='inner'))/len(pd.merge(registration, login, how='outer')))*100
pct_two = (len(all_data[all_data['reg_id'].isnull() == True]))/len(pd.merge(registration, login, how='outer'))*100

In [19]:
pct_one

33.33333333333333

In [20]:
pct_two

33.33333333333333

#### merge_odered

In [21]:
all_data = pd.merge(registration, login, how='outer')
all_data

   reg_id     name           phone  log_id
0     1.0     Joko   0867654656465     NaN
1     2.0     Agus  08767645335322     2.0
2     3.0     Adit   0832323232535     NaN
3     4.0  Vincent  08123424342424     4.0
4     NaN     Bobi    087463524267     1.0
5     NaN     Dodo    087363767363     3.0

In [22]:
all_data[['name', 'reg_id']].isnull().value_counts()

name   reg_id
False  False     4
       True      2
dtype: int64

In [23]:
all_data[all_data['reg_id'].isnull() == True].value_counts()

Series([], dtype: int64)